/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   cwr.h                                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mschimme <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/01/13 21:21:56 by mschimme          #+#    #+#             */
/*   Updated: 2020/10/31 20:12:01 by mschimme         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#ifndef CWR_H
# define CWR_H
# include <libft.h>
# include <termios.h>
# include <op.h>
# include "op_lims.h"
# include "cwr_defs.h"
# include "cwr_funcs.h"
# include <curses.h>
# include <sys/ioctl.h>

/*
**	curses.h - для графического режима.
**	ioctl.h - для получения актуальных данных по состоянию терминала.
**	termios.h - для контроля терминального устройства, в т.ч. для очистки
**	машинописного буфера ввода.
*/

#endif
